Revit 2026 API

# GroupLoadOptions Properties

---

The GroupLoadOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IncludeAttachedDetails | True if attached detail groups should be included, false otherwise. The default value is . |
|  | IncludeGrids | True if grids should be brought in from the input file, false otherwise. The default value is . |
|  | IncludeLevels | True if levels should be brought in from the input file, false otherwise. The default value is . |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ReplaceDuplicatedGroups | If there are groups with the same names in source and destination documents set this property to  to replace existing groups, otherwise the operation will be canceled. The default value is . |

#### Reference

GroupLoadOptions Class

Autodesk.Revit.DB Namespace